---
type: ExportFontInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# ExportFontInfo

`Autodesk.Revit.DB.ExportFontInfo` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExportFontInfo | — | `` |
| Constructor | ExportFontInfo | 2014 | `public ExportFontInfo ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | DestinationFontName | 2014 | `public string DestinationFontName { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |